Blockly.Blocks['weather'] = {
  init: function() {
    this.appendDummyInput()
      .appendField("取得氣象局資料");
    this.appendStatementInput("do")
      .setCheck(null)
      .appendField("執行");
    this.setPreviousStatement(true, null);
    this.setNextStatement(true, null);
    this.setColour(225);
    this.setTooltip("");
    this.setHelpUrl("https://www.cwb.gov.tw/");
  }
};


Blockly.Blocks['weather_aqi'] = {
  init: function() {
    this.appendDummyInput()
      .appendField("空氣品質，地點")
      .appendField(new Blockly.FieldDropdown([
        ["富貴角", "富貴角"],
        ["陽明", "陽明"],
        ["萬里", "萬里"],
        ["淡水", "淡水"],
        ["基隆", "基隆"],
        ["士林", "士林"],
        ["林口", "林口"],
        ["三重", "三重"],
        ["菜寮", "菜寮"],
        ["汐止", "汐止"],
        ["大同", "大同"],
        ["中山", "中山"],
        ["大園", "大園"],
        ["松山", "松山"],
        ["萬華", "萬華"],
        ["新莊", "新莊"],
        ["觀音", "觀音"],
        ["古亭", "古亭"],
        ["永和", "永和"],
        ["板橋", "板橋"],
        ["桃園", "桃園"],
        ["土城", "土城"],
        ["新店", "新店"],
        ["平鎮", "平鎮"],
        ["中壢", "中壢"],
        ["龍潭", "龍潭"],
        ["湖口", "湖口"],
        ["新竹", "新竹"],
        ["竹東", "竹東"],
        ["頭份", "頭份"],
        ["苗栗", "苗栗"],
        ["三義", "三義"],
        ["豐原", "豐原"],
        ["沙鹿", "沙鹿"],
        ["西屯", "西屯"],
        ["忠明", "忠明"],
        ["線西", "線西"],
        ["大里", "大里"],
        ["彰化", "彰化"],
        ["埔里", "埔里"],
        ["二林", "二林"],
        ["南投", "南投"],
        ["竹山", "竹山"],
        ["崙背", "崙背"],
        ["麥寮", "麥寮"],
        ["臺西", "臺西"],
        ["斗六", "斗六"],
        ["新港", "新港"],
        ["朴子", "朴子"],
        ["嘉義", "嘉義"],
        ["新營", "新營"],
        ["善化", "善化"],
        ["安南", "安南"],
        ["臺南", "臺南"],
        ["美濃", "美濃"],
        ["橋頭", "橋頭"],
        ["楠梓", "楠梓"],
        ["仁武", "仁武"],
        ["左營", "左營"],
        ["屏東", "屏東"],
        ["前金", "前金"],
        ["鳳山", "鳳山"],
        ["復興", "復興"],
        ["前鎮", "前鎮"],
        ["小港", "小港"],
        ["大寮", "大寮"],
        ["潮州", "潮州"],
        ["林園", "林園"],
        ["恆春", "恆春"],
        ["宜蘭", "宜蘭"],
        ["冬山", "冬山"],
        ["花蓮", "花蓮"],
        ["關山", "關山"],
        ["臺東", "臺東"],
        ["馬祖", "馬祖"],
        ["金門", "金門"],
        ["馬公", "馬公"],
        ["彰化(大城)", "彰化(大城)"],
        ["屏東(枋寮)", "屏東(枋寮)"],
        ["屏東(琉球)", "屏東(琉球)"],
        ["桃園(平鎮平南)", "桃園(平鎮平南)"]
      ]), "location")
      .appendField("類型")
      .appendField(new Blockly.FieldDropdown([
        ["PM2.5", "PM25"],
        ["PM10", "PM10"],
        ["臭氧", "O3"],
        ["二氧化氮", "NO2"],
        ["二氧化硫", "SO2"],
        ["空氣品質描述", "note"],
        ["空氣品質綜合指標", "all"]
      ]), "type");
    this.setOutput(true, null);
    this.setColour(180);
    this.setTooltip("");
    this.setHelpUrl("https://taqm.epa.gov.tw/taqm/tw/default.aspx");
  }
};
