Blockly.Blocks['weather'] = {
  init: function() {
    this.appendDummyInput()
      .appendField("取得氣象資料");
    this.appendStatementInput("do")
      .setCheck(null)
      .appendField("執行");
    this.setPreviousStatement(true, null);
    this.setNextStatement(true, null);
    this.setColour(225);
    this.setTooltip("");
    this.setHelpUrl("https://www.cwb.gov.tw/");
  }
};


Blockly.Blocks['weather_aqi'] = {
  init: function() {
    this.appendDummyInput()
      .appendField("空氣品質，地點")
      .appendField(new Blockly.FieldDropdown([
        ["北部 - 富貴角", "富貴角"],
        ["北部 - 陽明", "陽明"],
        ["北部 - 萬里", "萬里"],
        ["北部 - 淡水", "淡水"],
        ["北部 - 基隆", "基隆"],
        ["北部 - 士林", "士林"],
        ["北部 - 林口", "林口"],
        ["北部 - 三重", "三重"],
        ["北部 - 菜寮", "菜寮"],
        ["北部 - 汐止", "汐止"],
        ["北部 - 大同", "大同"],
        ["北部 - 中山", "中山"],
        ["北部 - 大園", "大園"],
        ["北部 - 松山", "松山"],
        ["北部 - 萬華", "萬華"],
        ["北部 - 新莊", "新莊"],
        ["北部 - 觀音", "觀音"],
        ["北部 - 古亭", "古亭"],
        ["北部 - 永和", "永和"],
        ["北部 - 板橋", "板橋"],
        ["北部 - 桃園", "桃園"],
        ["北部 - 土城", "土城"],
        ["北部 - 新店", "新店"],
        ["北部 - 平鎮", "平鎮"],
        ["北部 - 中壢", "中壢"],
        ["北部 - 龍潭", "龍潭"],
        ["竹苗 - 湖口", "湖口"],
        ["竹苗 - 新竹", "新竹"],
        ["竹苗 - 竹東", "竹東"],
        ["竹苗 - 頭份", "頭份"],
        ["竹苗 - 苗栗", "苗栗"],
        ["竹苗 - 三義", "三義"],
        ["中部 - 豐原", "豐原"],
        ["中部 - 沙鹿", "沙鹿"],
        ["中部 - 西屯", "西屯"],
        ["中部 - 忠明", "忠明"],
        ["中部 - 線西", "線西"],
        ["中部 - 大里", "大里"],
        ["中部 - 彰化", "彰化"],
        ["中部 - 埔里", "埔里"],
        ["中部 - 二林", "二林"],
        ["中部 - 南投", "南投"],
        ["中部 - 竹山", "竹山"],
        ["雲嘉南 - 崙背", "崙背"],
        ["雲嘉南 - 麥寮", "麥寮"],
        ["雲嘉南 - 臺西", "臺西"],
        ["雲嘉南 - 斗六", "斗六"],
        ["雲嘉南 - 新港", "新港"],
        ["雲嘉南 - 朴子", "朴子"],
        ["雲嘉南 - 嘉義", "嘉義"],
        ["雲嘉南 - 新營", "新營"],
        ["雲嘉南 - 善化", "善化"],
        ["雲嘉南 - 安南", "安南"],
        ["雲嘉南 - 臺南", "臺南"],
        ["高屏 - 美濃", "美濃"],
        ["高屏 - 橋頭", "橋頭"],
        ["高屏 - 楠梓", "楠梓"],
        ["高屏 - 仁武", "仁武"],
        ["高屏 - 左營", "左營"],
        ["高屏 - 屏東", "屏東"],
        ["高屏 - 前金", "前金"],
        ["高屏 - 鳳山", "鳳山"],
        ["高屏 - 復興", "復興"],
        ["高屏 - 前鎮", "前鎮"],
        ["高屏 - 小港", "小港"],
        ["高屏 - 大寮", "大寮"],
        ["高屏 - 潮州", "潮州"],
        ["高屏 - 林園", "林園"],
        ["高屏 - 恆春", "恆春"],
        ["宜蘭 - 宜蘭", "宜蘭"],
        ["宜蘭 - 冬山", "冬山"],
        ["花東 - 花蓮", "花蓮"],
        ["花東 - 關山", "關山"],
        ["花東 - 臺東", "臺東"],
        ["離島 - 馬祖", "馬祖"],
        ["離島 - 金門", "金門"],
        ["離島 - 馬公", "馬公"]
      ]), "location")
      .appendField("類型")
      .appendField(new Blockly.FieldDropdown([
        ["空氣品質綜合指標", "all"],
        ["空氣品質描述", "note"],
        ["PM2.5", "PM25"],
        ["PM10", "PM10"],
        ["臭氧", "O3"],
        ["二氧化氮", "NO2"],
        ["二氧化硫", "SO2"]
      ]), "type");
    this.setOutput(true, null);
    this.setColour(180);
    this.setTooltip("");
    this.setHelpUrl("https://taqm.epa.gov.tw/taqm/tw/default.aspx");
  }
};
